[
    {
        "name": "Aquarius",
        "startDay": 20,
        "startMonth": 1,
        "endDay": 18,
        "endMonth": 2,
        "element": "Air",
        "ruler": "Uranus, Saturn",
        "compatibility": "Leo, Sagittarius",
        "luckyNum": "4, 7, 11, 22, 29",
        "strength": "Progressive, original, independent, humanitarian",
        "weakness": "Runs from emotional expression, temperamental, uncompromising, aloof",
        "description": "Aquarius is one of the most unique signs of the zodiac, and people born under this sign experience a sense of uniqueness. This makes them eccentric and energetic in their fight for freedom, or at times shy and quiet, afraid to express their true personality. In both cases, they are deep thinkers and highly intellectual people who love to fight for idealistic causes. They can see people without prejudice, making them truly special. Although they can easily adapt to the energy that surrounds them, Aquarius representatives have a deep need for alone time to restore their inner power."
    },
    {
        "name": "Pisces",
        "startDay": 19,
        "startMonth": 2,
        "endDay": 20,
        "endMonth": 3,
        "element": "Water",
        "ruler": "Neptune, Jupiter",
        "compatibility": " Virgo, Taurus",
        "luckyNum": "3, 9, 12, 15, 18, 24",
        "strength": "Compassionate, artistic, intuitive, gentle, wise, musical",
        "weakness": "Fearful, overly trusting, sad, desire to escape reality, can be a victim or a martyr",
        "description": "Pisces is a very friendly sign, often finding themselves in the company of diverse people. They are selfless and always willing to help others, which is admirable as long as they don't expect too much in return. Individuals born with their Sun in Pisces possess an intuitive understanding of the life cycle, forming incredible emotional relationships with others based on the natural order and their senses."
    },
    {
        "name": "Aries",
        "startDay": 21,
        "startMonth": 3,
        "endDay": 19,
        "endMonth": 4,
        "element": "Fire",
        "ruler": "Mars",
        "compatibility": "Libra, Leo",
        "luckyNum": "1, 8, 17",
        "strength": "Courageous, determined, confident, enthusiastic, optimistic, honest, passionate",
        "weakness": "Impatient, moody, short-tempered, impulsive, aggressive",
        "description": "As the first sign in the zodiac, Aries' presence always marks the beginning of something energetic and turbulent. They are continuously seeking dynamic experiences, speed, and competition, always striving to be first in everything from work to social gatherings. With its ruling planet Mars and belonging to the element of Fire (like Leo and Sagittarius), Aries is one of the most active zodiac signs. It is in their nature to take action, sometimes before thinking things through."
    },
    {
        "name": "Taurus",
        "startDay": 20,
        "startMonth": 4,
        "endDay": 20,
        "endMonth": 5,
        "element": "Earth",
        "ruler": "Venus",
        "compatibility": "Scorpio, Cancer",
        "luckyNum": "2, 6, 9, 12, 24",
        "strength": "Reliable, patient, practical, devoted, responsible, stable",
        "weakness": "Stubborn, possessive, uncompromising",
        "description": "Taurus is a practical and well-grounded zodiac sign that values the fruits of their labor. They have a strong desire to be surrounded by love and beauty, and are drawn to the material world and physical pleasures. Individuals born under this sign are sensual and tactile, placing great importance on touch and taste as their primary senses. They are also known for being stable and conservative, making them one of the most dependable signs of the zodiac. Taurus individuals are committed to their choices and will endure until they reach a point of personal satisfaction."
    },
    {
        "name": "Gemini",
        "startDay": 21,
        "startMonth": 5,
        "endDay": 20,
        "endMonth": 6,
        "element": "Air",
        "ruler": "Mercury",
        "compatibility": "Sagittarius, Aquarius",
        "luckyNum": "5, 7, 14, 23",
        "strength": "Gentle, affectionate, curious, adaptable, ability to learn quickly and exchange ideas",
        "weakness": "Nervous, inconsistent, indecisive",
        "description": "Gemini is a zodiac sign that represents two different personalities in one, making them expressive and quick-witted. They are sociable, communicative, and always ready for fun, but can suddenly become serious, thoughtful, and restless. Their curiosity about the world knows no bounds, and they often feel like there is not enough time to experience everything they want to see."
    },
    {
        "name": "Cancer",
        "startDay": 21,
        "startMonth": 6,
        "endDay": 22,
        "endMonth": 7,
        "element": "Water",
        "ruler": "Moon",
        "compatibility": "Capricorn, Taurus",
        "luckyNum": "2, 3, 15, 20",
        "strength": "Tenacious, highly imaginative, loyal, emotional, sympathetic, persuasive",
        "weakness": "Moody, pessimistic, suspicious, manipulative, insecure",
        "description": "Cancer is a zodiac sign that is deeply intuitive and sentimental, making them one of the most challenging signs to get to know. They are highly emotional and sensitive, and prioritize matters related to family and home. Those born with their Sun in Cancer are very loyal and empathetic to the pain and suffering of others."
    },
    {
        "name": "Leo",
        "startDay": 23,
        "startMonth": 7,
        "endDay": 22,
        "endMonth": 8,
        "element": "Fire",
        "ruler": "Sun",
        "compatibility": "Aquarius, Gemini",
        "luckyNum": "1, 3, 10, 19",
        "strength": "Creative, passionate, generous, warm-hearted, cheerful, humorous",
        "weakness": "Arrogant, stubborn, self-centered, lazy, inflexible",
        "description": "Individuals born under the sign of Leo are known for their natural leadership abilities. They possess qualities such as creativity, self confidence, dominance and a strong presence that is hard to resist. Leos are capable of achieving anything they set their minds to in all aspects of their lives. The strength of a Leo lies in their `king of the jungle` status. They are typically generous and loyal, which enables them to have many friends. Their self confidence and attractiveness make them capable of bringing different groups of people together and leading them towards a common goal. Additionally Leos have a healthy sense of humor which makes it easier for them to collaborate with others."
    },
    {
        "name": "Virgo",
        "startDay": 23,
        "startMonth": 8,
        "endDay": 22,
        "endMonth": 9,
        "element": "Earth",
        "ruler": "Mercury",
        "compatibility": "Pisces, Cancer",
        "luckyNum": "5, 14, 15, 23, 32",
        "strength": "Loyal, analytical, kind, hardworking, practical",
        "weakness": "Shyness, worry, overly critical of self and others, all work and no play",
        "description": "Virgos are known for their meticulous attention to detail and their deep sense of humanity, which makes them one of the most caring signs of the zodiac. Their methodical approach to love and life ensures that nothing is left to chance. Although they can be tender, they may keep their heart closed to the outer world. This sign is often misunderstood not because they lack the ability to express themselves, but because they don't always trust their feelings and tend to prioritize reason over emotions. The symbolism behind their name reflects their nature as individuals who approach everything as if it were their first time experiencing it."
    },
    {
        "name": "Libra",
        "startDay": 23,
        "startMonth": 9,
        "endDay": 22,
        "endMonth": 10,
        "element": "Air",
        "ruler": "Venus",
        "compatibility": "Aries, Sagittarius",
        "luckyNum": "4, 6, 13, 15, 24",
        "strength": "Cooperative, diplomatic, gracious, fair-minded, social",
        "weakness": "Indecisive, avoids confrontations, will carry a grudge, self-pity",
        "description": "Individuals born under the sign of Libra are known for their peaceful and fair nature, and they generally dislike being alone. Partnership is crucial for them, and they seek someone who can reflect their inner selves. Librans are fascinated by balance and symmetry, and they are constantly striving for justice and equality, realizing that the most important thing in life is their own inner personality. They are willing to go to great lengths to avoid conflict and maintain peace whenever possible."
    },
    {
        "name": "Scorpio",
        "startDay": 23,
        "startMonth": 10,
        "endDay": 21,
        "endMonth": 11,
        "element": "Water",
        "ruler": "Pluto, Mars",
        "compatibility": "Taurus, Cancer",
        "luckyNum": "8, 11, 18, 22",
        "strength": "Resourceful, powerful, brave, passionate, a true friend",
        "weakness": "Distrusting, jealous, manipulative, violent",
        "description": "Scorpios are known for their passionate and assertive nature with a level of determination and focus that is often unmatched by the other zodiac signs. They are known to delve deeply into research to uncover the truth behind anything they consider to be important. Scorpios are great leaders and guides who are resourceful, dedicated and fearless when faced with challenges."
    },
    {
        "name": "Sagittarius",
        "startDay": 22,
        "startMonth": 11,
        "endDay": 21,
        "endMonth": 12,
        "element": "Fire",
        "ruler": "Jupiter",
        "compatibility": "Gemini, Aries",
        "luckyNum": "3, 7, 9, 12, 21",
        "strength": "Generous, idealistic, great sense of humor",
        "weakness": "Promises more than can deliver, very impatient, will say anything no matter how undiplomatic",
        "description": "Sagittarius individuals are known for their curiosity and energy, making them natural travelers of the zodiac. Their open mind and philosophical views drive them to explore the world in search of the meaning of life. As extroverts, they are optimistic, enthusiastic, and always ready for change. While they are often preoccupied with mental work, they have the ability to turn their visions and thoughts into concrete actions and circumstances."
    },
    {
        "name": "Capricorn",
        "startDay": 22,
        "startMonth": 12,
        "endDay": 19,
        "endMonth": 1,
        "element": "Earth",
        "ruler": "Saturn",
        "compatibility": "Taurus, Cancer",
        "luckyNum": "4, 8, 13, 22",
        "strength": "Responsible, disciplined, self-control, good managers",
        "weakness": "Know-it-all, unforgiving, condescending, expecting the worst",
        "description": "Capricorn is a sign that is associated with time and responsibility. Capricorn individuals are typically traditional and serious in nature, possessing an inner sense of independence that allows them to make significant progress in both their personal and professional lives. They are skilled in self-control, can make realistic plans, and are capable of managing many people at once. Capricorns learn from their mistakes and rely on their experience and expertise to achieve success."
    }
]